In [8]:
import missingno as msno
import pandas as pd
import numpy as np
import matplotlib as plt
df_with_nulls = pd.DataFrame({'A':[1,100,np.nan,1000,10000],
                             'B':[2,4,2,4,np.nan],
                             'C':[40,np.nan,20,np.nan,np.nan]})
df_with_nulls

         A    B     C
0      1.0  2.0  40.0
1    100.0  4.0   NaN
2      NaN  2.0  20.0
3   1000.0  4.0   NaN
4  10000.0  NaN   NaN

In [9]:
df_with_nulls.dropna()

     A    B     C
0  1.0  2.0  40.0

In [10]:
df_with_nulls.dropna(thresh=2)

        A    B     C
0     1.0  2.0  40.0
1   100.0  4.0   NaN
2     NaN  2.0  20.0
3  1000.0  4.0   NaN

In [11]:
df_with_nulls.dropna(thresh=3,axis=1)

         A    B
0      1.0  2.0
1    100.0  4.0
2      NaN  2.0
3   1000.0  4.0
4  10000.0  NaN

In [12]:
df_with_nulls.fillna('NOWA WARTOŚĆ')

              A             B             C
0           1.0           2.0          40.0
1         100.0           4.0  NOWA WARTOŚĆ
2  NOWA WARTOŚĆ           2.0          20.0
3        1000.0           4.0  NOWA WARTOŚĆ
4       10000.0  NOWA WARTOŚĆ  NOWA WARTOŚĆ

In [13]:
df_with_nulls['B'].fillna(df_with_nulls['B'].mean())

0    2.0
1    4.0
2    2.0
3    4.0
4    3.0
Name: B, dtype: float64